plan.org
#+title: Interpretation for lazy and curious
* Interpretation. part 1
The core functionality of interpreters might be distilled to two steps.
1) Parse source code to some internal representation
2) Evaluate the internal representation, so it will be reduced to the result we need.
Here I will do my best to skip as much as possible of the first one.
You dont' need to know quantum physics to be able to swim.

** Can you do it?
When talking about interpretation  most of the people start thinking about complex things.
register allocation, memory management, grammars and DFAs.
I will try to keep it simple.
As simple as possible without loosing core of the essence.
Let's assume you have a yaml file
#+begin_src yaml
bold
- some text
- and more text
#+end_src

How hard would that be to transform this yaml to the html?
#+begin_src html
<b>
  <p>some text</p>
  <p> and more text></p>
</b>
#+end_src

My guess would be that majority of the developers won't have troubles with doing so.
We're just transforming on tree structure to another tree structure.

And this is the essense of interpretation. We're taking one tree structure and converting it to another tree structure.
If you can convert yaml to html, you're good to go.
* Parsing and other friends
Most of the compilers and interpreters books start with parsing.
You neeed to investigate what DFA is, how it is different from NFA, and why regular expressions are not always the best choice.
Then you will follow on grammars. Context free grammars, left recursion elimination and so on.
After that you will be presented with tools that will make your life easier. Yacc, Bison, monadic parsers.
This usually happens 200-300 pages into the book. And while this is very important part of the story, I would like to argue this can be postponed to the point where you actually know what you are doing.
Therefore approach in this book will take us as fast as possible to the actual interpretation, skipping all unnecessary steps if possible.
To begin with we will start with arithmetic expressions.
** The simplest expressions you can think of
Implementing anything on JVM starts with interfaces.
let's us to the same and implement your first Expression
#+begin_src kotlin
interface Expression
#+end_src

It's not much, but we will improve it really fast. Just stay tuned.
*** Integer values
It is hard to do any computations when you don't have numbers.
#+begin_src kotlin
data class EInt(val v:Int):Expression
#+end_src
For now integers are more than enough for us to have. Adding boolean and float values will follow.
*** Addition
Adding additional addition to the mix would not be a problem
#+begin_src kotlin
data class EAdd(val a:EInt, val b:EInt): Expression

#+end_src
*** Multiplication
The same goes for the multiplication
#+begin_src kotlin
data class EMul(val a:EInt, val b:EInt): Expression
#+end_src
** What else can we add to the expressions
** Representing expressions in a code
Now we have all the required components to actually start calulating.
How would expression
#+begin_src kotlin
2+2
#+end_src
would look in our data class representation?
#+begin_src kotlin
EAdd(2,2)
#+end_src
Multiplication would not be that different
#+begin_src kotlin
5*5
#+end_src
#+begin_src kotlin
EMul(5, 5)
#+end_src
And if we want to express something more complex, we will just nest them
#+begin_src kotlin
(2+2)*5*5
#+end_src
#+begin_src kotlin
EMul(5, EMul(5, EAdd(2 , 2)))
#+end_src

* Evaluating expressions for fun and profit
** Evaluating integers. As simple as it gets
Having expresisons is nice, but why do we need them if we can't calculate them on the fly?
as TDD teaches us, you whould start from the test first.
So be it.
You never can be too slow when doing unit tests. Good coverage for the basics will let you know details of your code workings. As well will save you hours of debugging later on.

#+begin_src kotlin
    @Test
    fun testSimpleInteger(){
        assertEquals(EInt(5), eval(EInt(5)))
        assertEquals(EInt(-5), eval(EInt(-5)))
        assertEquals(EInt(0), eval(EInt(0)))
    }
#+end_src

What would be the easiest implementation of *eval* to make it run?
I came up with this one.
#+begin_src kotlin

fun eval( e:Expression): Expression{
    return e;
}
#+end_src
Probably would not require a lot of effort to understand what is happening here.
and it also makes our tests green.


