plan.tex
% Created 2022-10-08 Sat 23:48
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\author{Oleg Taykalo}
\date{\today}
\title{Interpretation for lazy and curious}
\hypersetup{
 pdfauthor={Oleg Taykalo},
 pdftitle={Interpretation for lazy and curious},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Interpretation. part 1}
\label{sec:orge2ca1cb}
The core functionality of interpreters might be distilled to two steps.
\begin{enumerate}
\item Parse source code to some internal representation
\item Evaluate the internal representation, so it will be reduced to the result we need.
\end{enumerate}
Here I will do my best to skip as much as possible of the first one.
You dont' need to know quantum physics to be able to swim.

\subsection{Can you do it?}
\label{sec:org400f6f2}
When talking about interpretation  most of the people start thinking about complex things.
register allocation, memory management, grammars and DFAs.
I will try to keep it simple.
As simple as possible without loosing core of the essence.
Let's assume you have a yaml file
\begin{minted}[]{yaml}
bold
- some text
- and more text
\end{minted}

How hard would that be to transform this yaml to the html?
\begin{minted}[]{html}
<b>
  <p>some text</p>
  <p> and more text></p>
</b>
\end{minted}

My guess would be that majority of the developers won't have troubles with doing so.
We're just transforming on tree structure to another tree structure.

And this is the essense of interpretation. We're taking one tree structure and converting it to another tree structure.
If you can convert yaml to html, you're good to go.
\section{Parsing and other friends}
\label{sec:orge63e23e}
Most of the compilers and interpreters books start with parsing.
You neeed to investigate what DFA is, how it is different from NFA, and why regular expressions are not always the best choice.
Then you will follow on grammars. Context free grammars, left recursion elimination and so on.
After that you will be presented with tools that will make your life easier. Yacc, Bison, monadic parsers.
This usually happens 200-300 pages into the book. And while this is very important part of the story, I would like to argue this can be postponed to the point where you actually know what you are doing.
Therefore approach in this book will take us as fast as possible to the actual interpretation, skipping all unnecessary steps if possible.
To begin with we will start with arithmetic expressions.
\subsection{The simplest expressions you can think of}
\label{sec:orgd59d7a3}
Implementing anything on JVM starts with interfaces.
let's us to the same and implement your first Expression
\begin{minted}[]{kotlin}
interface Expression
\end{minted}

It's not much, but we will improve it really fast. Just stay tuned.
\subsubsection{Integer values}
\label{sec:orgf4113f7}
It is hard to do any computations when you don't have numbers.
\begin{minted}[]{kotlin}
data class EInt(val v:Int):Expression
\end{minted}
For now integers are more than enough for us to have. Adding boolean and float values will follow.
\subsubsection{Addition}
\label{sec:orgc50c966}
Adding additional addition to the mix would not be a problem
\begin{minted}[]{kotlin}
data class EAdd(val a:EInt, val b:EInt): Expression

\end{minted}
\subsubsection{Multiplication}
\label{sec:orgcad5e7d}
The same goes for the multiplication
\begin{minted}[]{kotlin}
data class EMul(val a:EInt, val b:EInt): Expression
\end{minted}
\subsection{What else can we add to the expressions}
\label{sec:orgd5a106f}
\subsection{Representing expressions in a code}
\label{sec:org762cddf}
Now we have all the required components to actually start calulating.
How would expression
\begin{minted}[]{kotlin}
2+2
\end{minted}
would look in our data class representation?
\begin{minted}[]{kotlin}
EAdd(2,2)
\end{minted}
Multiplication would not be that different
\begin{minted}[]{kotlin}
5*5
\end{minted}
\begin{minted}[]{kotlin}
EMul(5, 5)
\end{minted}
And if we want to express something more complex, we will just nest them
\begin{minted}[]{kotlin}
(2+2)*5*5
\end{minted}
\begin{minted}[]{kotlin}
EMul(5, EMul(5, EAdd(2 , 2)))
\end{minted}

\section{Evaluating expressions for fun and profit}
\label{sec:org867e9f2}
\subsection{Evaluating integers. As simple as it gets}
\label{sec:org529ade6}
Having expresisons is nice, but why do we need them if we can't calculate them on the fly?
as TDD teaches us, you whould start from the test first.
So be it.
You never can be too slow when doing unit tests. Good coverage for the basics will let you know details of your code workings. As well will save you hours of debugging later on.

\begin{minted}[]{kotlin}
    @Test
    fun testSimpleInteger(){
        assertEquals(EInt(5), eval(EInt(5)))
        assertEquals(EInt(-5), eval(EInt(-5)))
        assertEquals(EInt(0), eval(EInt(0)))
    }
\end{minted}

What would be the easiest implementation of \textbf{eval} to make it run?
I came up with this one.
\begin{minted}[]{kotlin}

fun eval( e:Expression): Expression{
    return e;
}
\end{minted}
Probably would not require a lot of effort to understand what is happening here.
and it also makes our tests green.
