plan.org
** Evaluating addition
Now we are facing our first real challenge.
How can we evaluate addition?

As usual, let us start with the unit tests, so we don't have a suprises later on.
#+begin_src kotlin
 @Test
    fun testSimpleAddition(){
        assertEquals(EInt(5), eval(EAdd(EInt(5), EInt(0))))
        assertEquals(EInt(5), eval(EAdd(EInt(0), EInt(5))))
        assertEquals(EInt(10), eval(EAdd(EInt(7), EInt(3))))
        assertEquals(EInt(7), eval(EAdd(EInt(-3), EInt(10))))
        assertEquals(EInt(6), eval(EAdd(EInt(10), EInt(-4))))
    }
#+end_src

obviously if we try to run them now, we would have an error

#+begin_src kotlin
Expected :EInt(v=5)
Actual   :EAdd(a=EInt(v=5), b=EInt(v=0))
#+end_src
By the way - this is one of the reasons Kotlin is a nice language for these kind of exercises.
You don't need to write a lot of boilerplates for the *data class*, string representation looks reasonalbe, and saves some mental space for more important things.

We have a red test. What is the simplest way to make it green?
#+begin_src kotlin

fun eval( e:Expression): Expression{
    if(e is EAdd){
        return EInt( e.a.v + e.b.v)
    }
    return e
}
#+end_src

would this be enough?

Oh wow, tests are green now. But i am not big fan of 'e.a.v' looks very obscure
Green test allows us to do refactoring bit.

#+begin_src kotlin
data class EInt(val value:Int):Expression

fun eval( expression:Expression): Expression{
    if(expression is EAdd){
        return EInt(expression.a.value + expression.b.value)
    }
    return expression
}
#+end_src

Are we done with the addition?

What about more complex example?
#+begin_src kotlin
1 + 2 + 3 => 6
assertEquals(EInt(6), eval( EAdd(EInt(1), EAdd( EInt(2),EInt(3)) )))
#+end_src

And our compiler complains.
#+begin_src
Type mismatch: inferred type is EAdd but EInt was expected
#+end_src

Why is that? Oh yes. in our definition we are expecitng that *EAdd* expects integers as a parameters.
#+begin_src kotlin
data class EAdd(val a:EInt, val b:EInt): Expression
#+end_src
But now we are trying to pass *EAdd* as second paramter. Of course we should have an error here.

As usual with TDD approach we fixe it with the simplest way possible
#+begin_src kotlin
data class EAdd(val a:Expression, val b:Expression): Expression
#+end_src

Hopefully it will solve our issue.

But apparently it would not.

We get yet another nasty error in our *eval* function

#+begin_src kotlin
fun eval( expression:Expression): Expression{
    if(expression is EAdd){
        return EInt(expression.a.value + expression.b.value)
        //                         ^
        //                         |
        // unresolved reference: value
    }
    return expression
}
#+end_src

Any ideas?
Sure. *value* is a field of and integer, and now EAdd works with generic expressions, which might not have a value.
So we need to come up with a way of converting addition result to values.

#+begin_src kotlin
fun eval( expression:Expression): Expression{
    if(expression is EAdd){
        val left: EInt = eval(expression.a) as EInt
        val right: EInt  = eval(expression.b) as EInt
        return EInt(left.value + right.value)
    }
    return expression
}
#+end_src
This expression is worth to take a closer look.
To execute and addition, we need to be sure that both our parameters are integers.
At the same time when we call *eval* we would get the *Expression* as a result.
Therefore we need to convert it to the class we want. In our case that would be *EInt*.

Of course this little piece of code might rise some questions.
What happens if during *eval* will return something different from *EInt* would not that break everything?
What will happen if during *eval* some error will be raised?
These are very good questions. and we will get to them later. For now let us keep our focus on general picture.

** Evaluating multiplication
After spending so much time on evaluating addition, expanding our expressions to support multiplication is straighforward.
But first - tests.
#+begin_src kotlin
    @Test
    fun testSimpleMultiplication()
    {
        assertEquals(EInt(0), eval(EMul(EInt(0), EInt(42))))
        assertEquals(EInt(0), eval(EMul(EInt(42), EInt(0))))
        assertEquals(EInt(42), eval(EMul(EInt(1), EInt(42))))
        assertEquals(EInt(42), eval(EMul(EInt(42), EInt(1))))
        assertEquals(EInt(4), eval(EMul(EInt(2), EInt(2))))
    }
#+end_src

and implementation
#+begin_src kotlin
fun eval( expression:Expression): Expression{
    if(expression is EAdd){
        val left: EInt = eval(expression.a) as EInt
        val right: EInt  = eval(expression.b) as EInt
        return EInt(left.value + right.value)
    }
    if(expression is EMul){
        val left: EInt = eval(expression.a) as EInt
        val right: EInt  = eval(expression.b) as EInt
        return EInt(left.value * right.value)
    }
    return expression
}
#+end_src

As you can see, the implementation is almost identical. The only difference we have іs the actual operation.

Let's add few more tests to make sure it works if we mix addition and multiplication
#+begin_src kotlin
    @Test
    fun testComplicatedMultiplication() {
        assertEquals(EInt(10), eval(EMul(EMul(EInt(1), EInt(5)), EInt(2))))
        assertEquals(EInt(12), eval(EMul(EAdd(EInt(1), EInt(5)), EInt(2))))
    }

#+end_src
All the tests are green. Nice.
In less than 20 lines of code we have working caclulator that can add and multiply arbitrary numbers.
#+begin_src kotlin
interface Expression
data class EInt(val value:Int):Expression
data class EMul(val a:Expression, val b:Expression): Expression
data class EAdd(val a:Expression, val b:Expression): Expression

fun eval( expression:Expression): Expression{
    if(expression is EAdd){
        val left: EInt = eval(expression.a) as EInt
        val right: EInt  = eval(expression.b) as EInt
        return EInt(left.value + right.value)
    }
    if(expression is EMul){
        val left: EInt = eval(expression.a) as EInt
        val right: EInt  = eval(expression.b) as EInt
        return EInt(left.value * right.value)
    }
    return expression
}

#+end_src


** Sidenotes
*** Moving evaluation into each expression
At this point all our evaluation is sitting within one *eval* function.
If we gonna add more expressions to the interpreter, amount of *if* statements will grow.
This can be avoided by extracting specific parts of the code, and moving them to expressions.
The result would look like this:
#+begin_src kotlin
interface Expression{
    fun eval():Expression
}
data class EInt(val value:Int):Expression {
    override fun eval(): Expression {
        return this
    }
}

data class EMul(val a:Expression, val b:Expression): Expression {
    override fun eval(): Expression {
        val left = a.eval() as EInt
        val right = b.eval() as EInt
        return EInt(left.value * right.value)
    }
}

data class EAdd(val a:Expression, val b:Expression): Expression {
    override fun eval(): Expression {
        val left = a.eval() as EInt
        val right = b.eval() as EInt
        return EInt(left.value + right.value)

    }
}
#+end_src

It would require to change the test implementation as well.

#+begin_src kotlin
 assertEquals(EInt(12), (EMul(EAdd(EInt(1), EInt(5)), EInt(2))).eval())

#+end_src
