plan.tex


\subsection{Evaluating addition}
\label{sec:org9caac3d}
Now we are facing our first real challenge.
How can we evaluate addition?

As usual, let us start with the unit tests, so we don't have a suprises later on.
\begin{minted}[]{kotlin}
 @Test
    fun testSimpleAddition(){
        assertEquals(EInt(5), eval(EAdd(EInt(5), EInt(0))))
        assertEquals(EInt(5), eval(EAdd(EInt(0), EInt(5))))
        assertEquals(EInt(10), eval(EAdd(EInt(7), EInt(3))))
        assertEquals(EInt(7), eval(EAdd(EInt(-3), EInt(10))))
        assertEquals(EInt(6), eval(EAdd(EInt(10), EInt(-4))))
    }
\end{minted}

obviously if we try to run them now, we would have an error

\begin{minted}[]{kotlin}
Expected :EInt(v=5)
Actual   :EAdd(a=EInt(v=5), b=EInt(v=0))
\end{minted}
By the way - this is one of the reasons Kotlin is a nice language for these kind of exercises.
You don't need to write a lot of boilerplates for the \textbf{data class}, string representation looks reasonalbe, and saves some mental space for more important things.

We have a red test. What is the simplest way to make it green?
\begin{minted}[]{kotlin}

fun eval( e:Expression): Expression{
    if(e is EAdd){
        return EInt( e.a.v + e.b.v)
    }
    return e
}
\end{minted}

would this be enough?

Oh wow, tests are green now. But i am not big fan of 'e.a.v' looks very obscure
Green test allows us to do refactoring bit.

\begin{minted}[]{kotlin}
data class EInt(val value:Int):Expression

fun eval( expression:Expression): Expression{
    if(expression is EAdd){
        return EInt(expression.a.value + expression.b.value)
    }
    return expression
}
\end{minted}

Are we done with the addition?

What about more complex example?
\begin{minted}[]{kotlin}
1 + 2 + 3 => 6
assertEquals(EInt(6), eval( EAdd(EInt(1), EAdd( EInt(2),EInt(3)) )))
\end{minted}

And our compiler complains.
\begin{verbatim}
Type mismatch: inferred type is EAdd but EInt was expected
\end{verbatim}

Why is that? Oh yes. in our definition we are expecitng that \textbf{EAdd} expects integers as a parameters.
\begin{minted}[]{kotlin}
data class EAdd(val a:EInt, val b:EInt): Expression
\end{minted}
But now we are trying to pass \textbf{EAdd} as second paramter. Of course we should have an error here.

As usual with TDD approach we fixe it with the simplest way possible
\begin{minted}[]{kotlin}
data class EAdd(val a:Expression, val b:Expression): Expression
\end{minted}

Hopefully it will solve our issue.

But apparently it would not.

We get yet another nasty error in our \textbf{eval} function

\begin{minted}[]{kotlin}
fun eval( expression:Expression): Expression{
    if(expression is EAdd){
        return EInt(expression.a.value + expression.b.value)
        //                         ^
        //                         |
        // unresolved reference: value
    }
    return expression
}
\end{minted}

Any ideas?
Sure. \textbf{value} is a field of and integer, and now EAdd works with generic expressions, which might not have a value.
So we need to come up with a way of converting addition result to values.

\begin{minted}[]{kotlin}
fun eval( expression:Expression): Expression{
    if(expression is EAdd){
        val left: EInt = eval(expression.a) as EInt
        val right: EInt  = eval(expression.b) as EInt
        return EInt(left.value + right.value)
    }
    return expression
}
\end{minted}
This expression is worth to take a closer look.
To execute and addition, we need to be sure that both our parameters are integers.
At the same time when we call \textbf{eval} we would get the \textbf{Expression} as a result.
Therefore we need to convert it to the class we want. In our case that would be \textbf{EInt}.

Of course this little piece of code might rise some questions.
What happens if during \textbf{eval} will return something different from \textbf{EInt} would not that break everything?
What will happen if during \textbf{eval} some error will be raised?
These are very good questions. and we will get to them later. For now let us keep our focus on general picture.

\subsection{Evaluating multiplication}
\label{sec:org64ee93c}
After spending so much time on evaluating addition, expanding our expressions to support multiplication is straighforward.
But first - tests.
\begin{minted}[]{kotlin}
    @Test
    fun testSimpleMultiplication()
    {
        assertEquals(EInt(0), eval(EMul(EInt(0), EInt(42))))
        assertEquals(EInt(0), eval(EMul(EInt(42), EInt(0))))
        assertEquals(EInt(42), eval(EMul(EInt(1), EInt(42))))
        assertEquals(EInt(42), eval(EMul(EInt(42), EInt(1))))
        assertEquals(EInt(4), eval(EMul(EInt(2), EInt(2))))
    }
\end{minted}

and implementation
\begin{minted}[]{kotlin}
fun eval( expression:Expression): Expression{
    if(expression is EAdd){
        val left: EInt = eval(expression.a) as EInt
        val right: EInt  = eval(expression.b) as EInt
        return EInt(left.value + right.value)
    }
    if(expression is EMul){
        val left: EInt = eval(expression.a) as EInt
        val right: EInt  = eval(expression.b) as EInt
        return EInt(left.value * right.value)
    }
    return expression
}
\end{minted}

As you can see, the implementation is almost identical. The only difference we have іs the actual operation.

Let's add few more tests to make sure it works if we mix addition and multiplication
\begin{minted}[]{kotlin}
    @Test
    fun testComplicatedMultiplication() {
        assertEquals(EInt(10), eval(EMul(EMul(EInt(1), EInt(5)), EInt(2))))
        assertEquals(EInt(12), eval(EMul(EAdd(EInt(1), EInt(5)), EInt(2))))
    }

\end{minted}
All the tests are green. Nice.
In less than 20 lines of code we have working caclulator that can add and multiply arbitrary numbers.
\begin{minted}[]{kotlin}
interface Expression
data class EInt(val value:Int):Expression
data class EMul(val a:Expression, val b:Expression): Expression
data class EAdd(val a:Expression, val b:Expression): Expression

fun eval( expression:Expression): Expression{
    if(expression is EAdd){
        val left: EInt = eval(expression.a) as EInt
        val right: EInt  = eval(expression.b) as EInt
        return EInt(left.value + right.value)
    }
    if(expression is EMul){
        val left: EInt = eval(expression.a) as EInt
        val right: EInt  = eval(expression.b) as EInt
        return EInt(left.value * right.value)
    }
    return expression
}

\end{minted}


\subsection{Sidenotes}
\label{sec:orgc3a2b7e}
\subsubsection{Moving evaluation into each expression}
\label{sec:org42d2d1b}
At this point all our evaluation is sitting within one \textbf{eval} function.
If we gonna add more expressions to the interpreter, amount of \textbf{if} statements will grow.
This can be avoided by extracting specific parts of the code, and moving them to expressions.
The result would look like this:
\begin{minted}[]{kotlin}
interface Expression{
    fun eval():Expression
}
data class EInt(val value:Int):Expression {
    override fun eval(): Expression {
        return this
    }
}

data class EMul(val a:Expression, val b:Expression): Expression {
    override fun eval(): Expression {
        val left = a.eval() as EInt
        val right = b.eval() as EInt
        return EInt(left.value * right.value)
    }
}

data class EAdd(val a:Expression, val b:Expression): Expression {
    override fun eval(): Expression {
        val left = a.eval() as EInt
        val right = b.eval() as EInt
        return EInt(left.value + right.value)

    }
}
\end{minted}

It would require to change the test implementation as well.

\begin{minted}[]{kotlin}
 assertEquals(EInt(12), (EMul(EAdd(EInt(1), EInt(5)), EInt(2))).eval())

\end{minted}
