plan.tex
\subsubsection{Simple optimisations}
\label{sec:orge2e1b94}
You might agree that multiplying anything by zero would not help a lot.
We can include it in our evaluation of \textbf{EMul}
\begin{minted}[]{kotlin}
data class EMul(val a:Expression, val b:Expression): Expression {
    override fun eval(): Expression {
        val left = a.eval() as EInt
        if (left.value == 0){
            return EInt(0)
        }
        val right = b.eval() as EInt
        return EInt(left.value * right.value)
    }
}
\end{minted}

And if you agree that integers are immutable values, we can avoid creating new copy of the EInt every time during the evaluation

\begin{minted}[]{kotlin}
val zeroInt = EInt(0)

data class EMul(val a:Expression, val b:Expression): Expression {
    override fun eval(): Expression {
        val left = a.eval() as EInt
        if (left.value == 0){
            return zeroInt
        }
        val right = b.eval() as EInt
        return EInt(left.value * right.value)
    }
}
\end{minted}
\section{The simplest parser you can think of}
\label{sec:org66ccf64}
To make the whole parsing easy, let us reiterate what problem are we trying to solve.
We need to take a string, and convert it to the expression.
It can be expressed in a test.
\begin{minted}[]{kotlin}
    @Test()
    fun testSimpleInt(){
        assertEquals(EInt(42), parse("42"))
    }
\end{minted}

As you might remember - we are lazy. So we will do something that would allow us to simplify things.
To use a library and a format a lot of people using now.
The most popular programming language of the century.
YAML.

\subsection{Parsing integers with yaml}
\label{sec:org7d01e69}
To make it work we would need to add dependency to the great \textbf{snakeyaml} library
\begin{minted}[]{kotlin}
dependencies {
    // https://mvnrepository.com/artifact/org.yaml/snakeyaml
    implementation("org.yaml:snakeyaml:1.32")

    testImplementation(kotlin("test"))
    testImplementation("org.junit.jupiter:junit-jupiter:5.9.0")
}
\end{minted}

having such a useful tool makes our lives easy.

\begin{minted}[]{kotlin}
import org.yaml.snakeyaml.Yaml

fun parse(input:String):Expression{
    val yaml = Yaml()
    val script = yaml.load<Any>(input)
    return EInt(script as Int)
}
\end{minted}

We cannot parse anything but integers now, but at least our tests are green. Isn't that great?
\subsection{Expanding yaml expressions to support addition}
\label{sec:org717676f}
If you remember, our goal is to convert from strings to expressions as easy as possible.
To make it happen, the language we would use should be very similar to the expressions we have.

\begin{minted}[]{kotlin}
EAdd(EInt(3), EInt(5))
\end{minted}

might be represented in yaml as
\begin{minted}[]{yaml}
add
  - 3
  - 5
\end{minted}

And more complex expresison
\begin{minted}[]{kotlin}
EMul(EInt(10), EAdd(EInt(1), EInt(2)))
\end{minted}
Will have a form
\begin{minted}[]{yaml}
mul
  - 10
  - add
    - 1
    - 2
\end{minted}

Obviously this is good enough if we want to use it as part of yaml files.
But when you adding such an expression to the unit test, you would suffer.
Suffering should be optional, and to removing it we will utilise little known feature of Yaml, called \url{https://yaml.org/spec/1.2.2/\#chapter-7-flow-style-productions}

\begin{minted}[]{kotlin}
EAdd(EInt(3), EInt(5))
\end{minted}
becomes
\begin{minted}[]{yaml}
[add, 3, 5]
\end{minted}

and
\begin{minted}[]{kotlin}
EMul(EInt(10), EAdd(EInt(1), EInt(2)))
\end{minted}
is represented as

\begin{minted}[]{yaml}
[mul, 10, [add, 1, 2]]
\end{minted}
I kinda like it. It is shorter, and represents our internal structure pretty much
\subsection{parsing yaml with predefined expressions}
\label{sec:orga23c64f}
Test goes first
\begin{minted}[]{kotlin}
   @Test()
    fun testSimpleAdd(){
        assertEquals(EAdd(EInt(3), EInt(5)), parse("[add, 3, 5]"))
    }
\end{minted}

When \textbf{snakeyaml} parses flow-style expressions, it returns ArrayList.
So all we need to do is convert ArrayList to expression we want

\begin{minted}[]{kotlin}
fun parse(input:String):Expression{
    val yaml = Yaml()
    val script = yaml.load<Any>(input)
    return convert(script)
}
fun convert(obj:Any):Expression{
   if(obj is Int){// if yaml loaded an integer -convert it to EInt
       return EInt(obj)
   }
    if(obj is ArrayList<*>){ // if we have arrayList
        val operation= obj[0] // we assume initial element is the name of operation
        if(operation == "add"){
            val left = convert(obj[1]) // converting first parameter of the operation
            val right = convert(obj[2]) // converting second parameter of the operation
            return EAdd(left, right)
        }
    }
    return EInt(-42) // since we don't have errors now, return something strange
}
\end{minted}

Essentially what we are doing here is very similar to the eval fucntion we defined previously.
Eval takes Expression as input and returns Integer values.
parse takes a string as an input and returns Expression.
Even conversion of addition look very similar. Pay attention to the recursive call in convert.

Of course if our source code would not have the structure we want, we will get very nasty errors.
But as was said previousy - let us focus on successful flow first, taking care of corner cases later.

Surprisingly enough, this implementation makes our test green.
Let's see if we try to parse more complicated expression.
\begin{minted}[]{kotlin}
    @Test
    fun testComplicatedAdd(){
        assertEquals(
            EAdd(EAdd(EInt(3), EInt(5)), EInt(42)),
            parse("[add, [add, 3,5], 42]"))
    }

\end{minted}

Green as well. Nice work!
\subsection{Adding multiplication to the mix}
\label{sec:org7a2db78}
Now we know what to expect, so we will add both tests from the beginning
\begin{minted}[]{kotlin}
    @Test
    fun testSimpleMultiplication(){
        assertEquals(EMul(EInt(11), EInt(33)), parse("[mul, 11, 33]"))
    }
    @Test
    fun testComplicatedMultiplication(){
        assertEquals(
            EMul(EMul(EInt(3), EInt(5)), EInt(42)),
            parse("[mul, [mul, 3,5], 42]"))
    }
\end{minted}

Implementation of parser is really simple. Nothing new under the sun.
\begin{minted}[]{kotlin}
fun convert(obj:Any):Expression{
    ...
    if(obj is ArrayList<*>){
        ...
        if(operation =="mul"){
            val left = convert(obj[1])
            val right = convert(obj[2])
            return EMul(left, right)
        }
\end{minted}

We have a parser for addition, and we have a parser for multiplication.
Let's see how well they are working together.
\begin{minted}[]{kotlin}
    @Test
    fun testMulAndAdd(){
         assertEquals(
            EMul(EAdd(EInt(22), EInt(11)), EInt(44)),
            parse("[mul, [add, 22, 11], 44]"))
    }
\end{minted}

Tests are green. Feels great, isn't it?

\subsection{Evaluating parsed expressions}
\label{sec:org85c55d8}
Now we have both parth of the story. We can take a string and convert it to an expression.
We can take an expression and evaluate it.
Let us add some more tests would confirm this fact.
\begin{minted}[]{kotlin}
    @Test
    fun testComplicatedExpressionWithParsing() {
        assertEquals(EInt(10), (EMul(EMul(EInt(1), EInt(5)), EInt(2))).eval())
        assertEquals(EInt(10), parse("[mul, [mul, 1, 5], 2]").eval())
        assertEquals(EInt(12), (EMul(EAdd(EInt(1), EInt(5)), EInt(2))).eval())
        assertEquals(EInt(12), parse("[mul, [add, 1, 5], 2]").eval())
    }
\end{minted}

I specifically put original version here, so it is easy to compare complexity of expressions and amount of brackets.
