plan.tex

\subsection{One more touch}
\label{sec:orga2bae4f}
If you look closely on the previous test, you might wondered, why did we use \textbf{EInt(10)} instead of just \textbf{10}? How hard would that be to make it happen?

Well, let's add one more operation, and call it \textbf{unparse}. It will take an expression and convert it to our yaml format. in such a way we will have the whole circle of life

Let us extend our expression interface with \textbf{unparse} method
\begin{minted}[]{kotlin}
interface Expression{
    fun eval():Expression
    fun unparse():String
}
\end{minted}

And expand our test cases for the parsing.
Make sure that unparsing parsed expression should give the same result
\begin{minted}[]{kotlin}

  @Test
    fun testSimpleIntUnparse(){
        assertEquals("42",EInt(42).unparse())
        assertEquals("42", parse("42").unparse())
    }

    @Test
    fun testSimpleAddUnparse(){
        val yaml = "[add, 3, 5]"
        assertEquals(yaml, EAdd(EInt(3), EInt(5)).unparse())
        assertEquals(yaml, parse(yaml).unparse())
    }
    @Test
    fun testComplicatedAddUnparse(){
        val yaml = "[add, [add, 3, 5], 42]"
        assertEquals(
            yaml,
            EAdd(EAdd(EInt(3), EInt(5)), EInt(42)).unparse())
        assertEquals(yaml, parse(yaml).unparse())
    }
    @Test
    fun testSimpleMultiplicationUnparse(){
        val yaml = "[mul, 11, 33]"

        assertEquals(yaml, EMul(EInt(11), EInt(33)).unparse())
        assertEquals(yaml, parse(yaml).unparse())
    }
    @Test
    fun testComplicatedMultiplicationUnparse(){
        val yaml = "[mul, [mul, 3, 5], 42]"
        assertEquals(
            yaml,
            EMul(EMul(EInt(3), EInt(5)), EInt(42)).unparse())
        assertEquals(yaml, parse(yaml).unparse())
    }
    @Test
    fun testMulAndAddUnparse(){
        val yaml = "[mul, [add, 22, 11], 44]"
        assertEquals(
            yaml,
            EMul(EAdd(EInt(22), EInt(11)), EInt(44)).unparse())
        assertEquals(yaml, parse(yaml).unparse())
    }

\end{minted}

Remember, the more tests you have, the less corner cases you should worry about.

implementation is straightforward.

\begin{minted}[]{kotlin}
data class EInt(val value:Int):Expression {
    ...
    override fun unparse(): String {
        return value.toString()
    }
}

data class EMul(val a:Expression, val b:Expression): Expression {
    ...
    override fun unparse(): String {
        return "[mul, ${a.unparse()}, ${b.unparse()}]".format()
    }
}

data class EAdd(val a:Expression, val b:Expression): Expression {
    ...
    override fun unparse(): String {
        return "[add, ${a.unparse()}, ${b.unparse()}]"
    }
}
\end{minted}
As expected, tests are passing.
\subsection{Evaluating parsed expressions}
\label{sec:org4f57534}
We took some detour to make the basics work. Now we know how to read yaml, interpret the contents of the yaml using intermediate representation, and save results back to the yaml. Which in turn can be read, interpreted and saved to yaml.

But what is missing is some tests that confirm that our assumptions are correct.
\begin{minted}[]{kotlin}
 @Test
    fun testSimpleIntegerWithParsing() {
        assertEquals(EInt(5), parse("5").eval())
        assertEquals(EInt(-5),parse("-5").eval())
        assertEquals(EInt(0), parse("0").eval())
    }

    @Test
    fun testSimpleAdditionWithParsing() {
        assertEquals(EInt(5), parse("[add, 5, 0]").eval())
        assertEquals(EInt(5), parse("[add, 0, 5]").eval())
        assertEquals(EInt(10),parse("[add, 7, 3]").eval())
        assertEquals(EInt(7), parse("[add, -3, 10]").eval())
        assertEquals(EInt(6), parse("[add, 10, -4]").eval())
    }

    @Test
    fun testComplexAdditionWithParsing() {
        assertEquals(EInt(6),  parse("[add, 1, [add, 2,3]]").eval())
    }

    @Test
    fun testSimpleMultiplicationWithParsing() {
        assertEquals(EInt(0), parse("[mul, 0, 42]").eval())
        assertEquals(EInt(0), parse("[mul, 42, 0]").eval())
        assertEquals(EInt(42),parse("[mul, 1, 42]").eval())
        assertEquals(EInt(42), parse("[mul, 42, 1]").eval())
        assertEquals(EInt(4), parse("[mul, 2, 2]").eval())
    }

    @Test
    fun testComplicatedMultiplicationWithParsing() {
        assertEquals(EInt(10), parse("[mul, 1, [mul, 5, 2]]").eval())
        assertEquals(EInt(12), parse("[mul, 2, [add, 5, 1]]").eval())

        assertEquals("10", parse("[mul, 1, [mul, 5, 2]]").eval().unparse())
        assertEquals("12", parse("[mul, 2, [add, 5, 1]]").eval().unparse())
    }
\end{minted}

In the last test you can see all the parts working together.
And as you might have guessed, our tests are passing.
\subsection{Food for thought}
\label{sec:orgf979707}
Parsing plays important role in the whole evaluation process. While we simplified it to the minimum, we still can improve it.

For example - we have duplication while parsing addition and multiplication operations.
One way to make it better would be to add support to binary arithmetical operations.
But that would come at the cost of complicating our abstract syntax tree. As usual in the computer science - you cannot remove the complexity. You can just move it in some other place.

Here's another puzzle for you. What should this expression be parsed into?
\begin{minted}[]{kotlin}
[mul, 0, [add, 11, 42]]
\end{minted}

One might argue it is obvious - result is
\begin{minted}[]{kotlin}
EMul(EInt(0), EAdd(EInt(11), EInt(42)))
\end{minted}

But equally good option is
\begin{minted}[]{kotlin}
EInt(0)
\end{minted}

Since we know that multiplication by zero would give us zero in the end, why bother creating complex expression?
And as in previous example - we are simplifiying evaluation by complicating parsing.
You cannot remove the complexity. You can just push it somewhere else.
\subsection{Reflecting and Wrapping up}
\label{sec:org495c7a3}
It took some time and turns to get to this point.
A lot of text, and a lot of explanations. But try to look at it from the different perspective.
our parser is 26 lines long, and our interpreter is just 42 lines long.
In less than 100 lines we have fully functional interpreter, that can deal with complex math expressions.
And load and save expressions to yaml.

Let's look at our code in its full glory.
\begin{minted}[]{kotlin}
// Domain.kt
interface Expression{
    fun eval():Expression
    fun unparse():String
}
data class EInt(val value:Int):Expression {
    override fun eval(): Expression {
        return this
    }

    override fun unparse(): String {
        return value.toString()
    }
}

val zeroInt = EInt(0)
data class EMul(val a:Expression, val b:Expression): Expression {
    override fun eval(): Expression {
        val left = a.eval() as EInt
        if (left.value == 0){
            return zeroInt
        }
        val right = b.eval() as EInt
        return EInt(left.value * right.value)
    }

    override fun unparse(): String {
        return "[mul, ${a.unparse()}, ${b.unparse()}]".format()
    }
}

data class EAdd(val a:Expression, val b:Expression): Expression {
    override fun eval(): Expression {
        val left = a.eval() as EInt
        val right = b.eval() as EInt
        return EInt(left.value + right.value)

    }

    override fun unparse(): String {
        return "[add, ${a.unparse()}, ${b.unparse()}]"
    }
}
// Parser.kt
import org.yaml.snakeyaml.Yaml

fun parse(input:String):Expression{
    val yaml = Yaml()
    val script = yaml.load<Any>(input)
    return convert(script)
}
fun convert(obj:Any):Expression{
   if(obj is Int){
       return EInt(obj)
   }
    if(obj is ArrayList<*>){
        val operation= obj[0]
        if(operation == "add"){
            val left = convert(obj[1])
            val right = convert(obj[2])
            return EAdd(left, right)
        }
        if(operation =="mul"){
            val left = convert(obj[1])
            val right = convert(obj[2])
            return EMul(left, right)
        }
    }
    return EInt(-42)
}
\end{minted}
