plan.org
* Core language, host language and a lot of sugar
When implementing and interpreter you want to have ability to define new type of capabilites.
At the same time you don't want to spend too much time refactoring base implementation.
Changing Ast and tests for it, implementations, is very time consuming process.
** core, host, sugared
This can be avoided by introducing new level of abstration. As you know, you can solve every problem in IT by adding an additional level of abstraction.
Let's call our arimetic language we have the core language. It is core of our interpreter, and we don't want to expose its internal for the customers.
We would like to keep it as small as possible, so all refatoring and optimisations would have smaller blast radius.
As for ease of use we can create new expressions, which we would call sugared expressions.
They will be used as our interface, and should be converted to the core language to be interpreted
** Adding sugar
Let's say we want to add new operation to the mix *sub*, which stands for the substraction.
how would it fit to our idea of sugared language?
#+begin_src kotlin
interface SugarExpression{
    fun desugar():Expression
}

data class SugarInt(val v:Int):SugarExpression{
    override fun desugar(): Expression {
        return EInt(v)
    }
}

data class SugarAdd(val left:SugarExpression, val right:SugarExpression) : SugarExpression{
    override fun desugar(): Expression {
       return EAdd(left.desugar(), right.desugar())
    }

}

data class SugarMul(val left:SugarExpression, val right:SugarExpression): SugarExpression{
    override fun desugar(): Expression {
       return EMul(left.desugar(), right.desugar())
    }
}
#+end_src
Now it is pretty much replicating what with had with the usual expression.
Main difference might be that we don't evaluate anything here. We're just converting Sugared expression to our core expressions.

*** Defining substraction
Now we can extend our sugared languge with substraction function.
#+begin_src kotlin

// Take a closer look at this method
data class SugarSub(val left:SugarExpression, val right: SugarExpression):SugarExpression{
    override fun desugar(): Expression {
       return EAdd(left.desugar(),  EMul(EInt(-1), right.desugar() ))
    }
}
#+end_src

Just have a look.
We don't have substraction at our core language. But our customers might never know about it.
For what they care, they can call *sub* function, and it would return the expected result to them.
Isnt' that nice?

But sharp-eyed reader might notice, that this implemantation would not work.
Our parser returns Expressions, not SugarExpressions. We need to change that.
And add few more unit tests to the mix.

our parser looks like this now
#+begin_src kotlin
import org.yaml.snakeyaml.Yaml

fun parse(input:String):SugarExpression{
    val yaml = Yaml()
    val script = yaml.load<Any>(input)
    return convert(script)
}
fun convert(obj:Any):SugarExpression{
   if(obj is Int){
       return SugarInt(obj)
   }
    if(obj is ArrayList<*>){
        val operation= obj[0]
        if(operation == "add"){
            val left = convert(obj[1])
            val right = convert(obj[2])
            return SugarAdd(left, right)
        }
        if(operation =="mul"){
            val left = convert(obj[1])
            val right = convert(obj[2])
            return SugarMul(left, right)
        }
        if(operation =="sub"){
            val left = convert(obj[1])
            val right = convert(obj[2])
            return SugarSub(left, right)
        }
    }
    return SugarInt(-42)
}
#+end_src

our tests should be changed in quite a few places. For example, parsing should be updated
#+begin_src kotlin
 @Test
    fun testComplicatedMultiplicationUnparse(){
        val yaml = "[mul, [mul, 3, 5], 42]"
        assertEquals(
            yaml,
            SugarMul(SugarMul(SugarInt(3), SugarInt(5)), SugarInt(42)).desugar().unparse())
        assertEquals(yaml, parse(yaml).desugar().unparse())
    }
    @Test
    fun testMulAndAddUnparse(){
        val yaml = "[mul, [add, 22, 11], 44]"
        assertEquals(
            yaml,
            SugarMul(SugarAdd(SugarInt(22), SugarInt(11)), SugarInt(44)).desugar().unparse())
        assertEquals(yaml, parse(yaml).desugar().unparse())
    }
#+end_src
Do you see this beatuful pattern of parse -> desugar -> unparse

Of course, evaluation tests should be changed as well
#+begin_src kotlin
 @Test
    fun testComplicatedMultiplicationWithParsing() {
        assertEquals(EInt(10), parse("[mul, 1, [mul, 5, 2]]").desugar().eval())
        assertEquals(EInt(12), parse("[mul, 2, [add, 5, 1]]").desugar().eval())

        assertEquals("10", parse("[mul, 1, [mul, 5, 2]]").desugar().eval().unparse())
        assertEquals("12", parse("[mul, 2, [add, 5, 1]]").desugar().eval().unparse())
    }
#+end_src

they follow the same pattern more or less. parse -> desugar -> eval -> unparse

Now that our little refactoring is done, we are in a good shape to add test for our substraction.

#+begin_src kotlin
    @Test
    fun testMulAndSubUnparse(){

        val yaml = "[mul, [sub, 22, 11], 44]"
        val desugared = "[mul, [add, [mul, -1, 22], 11], 44]"
        assertEquals(
            desugared,
            SugarMul(SugarSub(SugarInt(22), SugarInt(11)), SugarInt(44)).desugar().unparse())
        assertEquals(desugared, parse(yaml).desugar().unparse())
    }
#+end_src

It is a good idea to test that evaluation of substraciton works as well.

#+begin_src kotlin
    @Test
    fun testMulAndSubEvaluationWithParsing(){
        val yaml = "[mul, [sub, 22, 11], 44]"
        assertEquals("484", parse(yaml).desugar().eval().unparse())
    }
#+end_src

We've just expanded our language with one more built-in function, wihout touching the core interpretation logic. And whast is even more interesting - the result of evaluation is correct.
