plan.org
** Adding negation operation
Now we can expand our primitive list by adding operation *neg* which should change the sight of the operation.

Since we're working with the sugared operations, we can approach to this having this definition
#+begin_src kotlin
data class SugarNeg(val value:SugarExpression):SugarExpression{
    override fun desugar(): Expression {
       return EMul(EInt(-1), value.desugar())
    }

}
#+end_src

Or we might go other way around.

#+begin_src kotlin
data class SugarNeg2(val value:SugarExpression):SugarExpression{
    override fun desugar(): Expression {
       return SugarSub(SugarSub(value, value), value).desugar()
    }

}
#+end_src

Second one would not be the most efficient implementation, but would reduce our dependency on the core language. As you might see there's no core language structures besides *Expression* as return value.

This is a great example of flexibility sugaring and desugaring brings to the table.

If we implemented negation first, we might change our implementation of *sub* as well.
#+begin_src kotlin
data class SugarSub2(val left:SugarExpression, val right:SugarExpression):SugarExpression{
    override fun desugar(): Expression {
       return EAdd(SugarNeg(left).desugar(), right.desugar())
    }
}
#+end_src

As you can see, sugaring gives a lot of flexibility towards how our functions are implemented.

Let's finish our negation by adding some tests and parsing bits.
#+begin_src kotlin
        if(operation =="neg"){
            val value = convert(obj[1])
            return SugarNeg(value)
        }
#+end_src

and test cases for the parsing
#+begin_src kotlin
    @Test
    fun testNegUnparse()
    {
        val yaml = "[neg, [mul, 2, 10]]"
        val desugared = "[mul, -1, [mul, 2, 10]]"
        assertEquals(desugared, SugarNeg(SugarMul(SugarInt(2), SugarInt(10))).desugar().unparse())
        assertEquals(desugared, parse(yaml).desugar().unparse())
    }
#+end_src

and for the evaluation as well
#+begin_src kotlin
    @Test
    fun testNegationEvaluation(){
        val yaml = "[neg, [mul, [sub, 22, 11], 44]]"
        assertEquals("-484", parse(yaml).desugar().eval().unparse())
    }
#+end_src

Remember, there's no such thing as too many tests, if they all make sense.


We will get back to the sugaring concept later. It is very powerful idea worth revisiting.

** Food for thought
- You want to add *uminus* operation, which is operates exactly like negation, but has different representation in yaml syntax.
  #+begin_src yaml
[uminus, [mul, [sub, 22, 11]], 44]
  #+end_src
  Can you think of a way to make this evaluation possible touching only parsing?

* Adding primitive functions to the language
Now that we know how to add new functions as part of our sugaring process, we might ask ourselves :
"Is it possible to define new functions without touching the host language"?
Now every new defined function should have some correspondence in Kotlin.
It would be nice to make it happen in yaml directly.

Let's come up with the syntax for the function definition.
It might have a lot of different flavors, but all of them should take care of few elements
0. keyword for function definition
1. function name
2. function arguments
3. body of the function

We can start with the double function
#+begin_src yaml
fun   # keyword for the function definition
 - [double, x]  # function name and arguments
 - [add, x, x]  # body of the function
#+end_src

Of course short version would be preferrable for unit tests.
#+begin_src yaml
[fun, [double, x], [add, x, x]]
#+end_src

After defining *double* function, it is really tempting to introduce *quad* function

#+begin_src yaml
[fun, [quad, x], [double, [double, x]]]
#+end_src
functions should be able to call one another, otherwise what is the point in defining them?


Functions without parameters should also be possible.

#+begin_src yaml
[fun, [const42], 42]
#+end_src

We will work with functions having single argument for now, and will deal with multiple arguments representation little bit later.

** Dealing with function and argument names
Now we have a good understanding how our function definitions would look like in yaml, let's think about how we gonna represent them in Kotlin.

Before we start implementing anyting, we need to decide, how we can represent function and variables names.

#+begin_src yaml
[fun, [double, x], [add, x, x]]
#+end_src

When looking into this expression from yaml perspective `x` and `double` will be represented as strings.
But semantically they should be different. They should represent some identifier, or a symbol if you wish.

Therefore we need to expand our parser to support symbols.

#+begin_src kotlin
data class ESymbol(val value:String):Expression{
    override fun eval(): Expression {
        return this
    }

    override fun unparse(): String {
        return value
    }
}

#+end_src

Here how our representation would look like
#+begin_src kotlin
data class EFunDef(val name:ESymbol, val argument:ESymbol, val body:Expression):Expression{
    override fun eval(): Expression {
        return this
    }

    override fun unparse(): String {
        return "[fun, [${name.unparse()}, ${argument.unparse()}], ${body.unparse()}]"
    }
}

#+end_src

Function definition is evaluated to itself. It is just a delcaration of the function, it doesn't do anything at all.

To make a function call, we need to have different structure. In some places it is called *function application*, i would use *function call*, since it is less academic and more commonly used
#+begin_src kotlin
data class EFunCall(val name:ESymbol, val argument:Expression):Expression{
    override fun eval(): Expression {
        TODO("Not yet implemented")
    }

    override fun unparse(): String {
        return "[${name.unparse()}, ${argument.unparse()}]"
    }

}
#+end_src

We dont' know exactly how evaluation will work, but we can alreade expand our parser to support both function definitions and function calls.
** Expanding parser for function definitions and calls
When we are starting new implementation, and not totally sure what expected result is, we write tests.
Parsing function definition looks like a good point.


* Pros and cons of sugaring
** performance hit
** simplified runtime
** Haskell core language
** targeting degugaring
** WebAssembly desugar
** python desugar

* Errors and strange things
** adding division
** what should happen if we divide by zero?
** It's all about environment
