plan.tex
\subsection{Adding negation operation}
\label{sec:orga0f50f0}
Now we can expand our primitive list by adding operation \textbf{neg} which should change the sight of the operation.

Since we're working with the sugared operations, we can approach to this having this definition
\begin{minted}[]{kotlin}
data class SugarNeg(val value:SugarExpression):SugarExpression{
    override fun desugar(): Expression {
       return EMul(EInt(-1), value.desugar())
    }

}
\end{minted}

Or we might go other way around.

\begin{minted}[]{kotlin}
data class SugarNeg2(val value:SugarExpression):SugarExpression{
    override fun desugar(): Expression {
       return SugarSub(SugarSub(value, value), value).desugar()
    }

}
\end{minted}

Second one would not be the most efficient implementation, but would reduce our dependency on the core language. As you might see there's no core language structures besides \textbf{Expression} as return value.

This is a great example of flexibility sugaring and desugaring brings to the table.

If we implemented negation first, we might change our implementation of \textbf{sub} as well.
\begin{minted}[]{kotlin}
data class SugarSub2(val left:SugarExpression, val right:SugarExpression):SugarExpression{
    override fun desugar(): Expression {
       return EAdd(SugarNeg(left).desugar(), right.desugar())
    }
}
\end{minted}

As you can see, sugaring gives a lot of flexibility towards how our functions are implemented.

Let's finish our negation by adding some tests and parsing bits.
\begin{minted}[]{kotlin}
        if(operation =="neg"){
            val value = convert(obj[1])
            return SugarNeg(value)
        }
\end{minted}

and test cases for the parsing
\begin{minted}[]{kotlin}
    @Test
    fun testNegUnparse()
    {
        val yaml = "[neg, [mul, 2, 10]]"
        val desugared = "[mul, -1, [mul, 2, 10]]"
        assertEquals(desugared, SugarNeg(SugarMul(SugarInt(2), SugarInt(10))).desugar().unparse())
        assertEquals(desugared, parse(yaml).desugar().unparse())
    }
\end{minted}

and for the evaluation as well
\begin{minted}[]{kotlin}
    @Test
    fun testNegationEvaluation(){
        val yaml = "[neg, [mul, [sub, 22, 11], 44]]"
        assertEquals("-484", parse(yaml).desugar().eval().unparse())
    }
\end{minted}

Remember, there's no such thing as too many tests, if they all make sense.


We will get back to the sugaring concept later. It is very powerful idea worth revisiting.

\subsection{Food for thought}
\label{sec:org6802366}
\begin{itemize}
\item You want to add \textbf{uminus} operation, which is operates exactly like negation, but has different representation in yaml syntax.
\begin{minted}[]{yaml}
[uminus, [mul, [sub, 22, 11]], 44]
\end{minted}
Can you think of a way to make this evaluation possible touching only parsing?
\end{itemize}

\section{Adding primitive functions to the language}
\label{sec:org3372292}
Now that we know how to add new functions as part of our sugaring process, we might ask ourselves :
``Is it possible to define new functions without touching the host language''?
Now every new defined function should have some correspondence in Kotlin.
It would be nice to make it happen in yaml directly.

Let's come up with the syntax for the function definition.
It might have a lot of different flavors, but all of them should take care of few elements
\begin{enumerate}
\item keyword for function definition
\item function name
\item function arguments
\item body of the function
\end{enumerate}

We can start with the double function
\begin{minted}[]{yaml}
fun   # keyword for the function definition
 - [double, x]  # function name and arguments
 - [add, x, x]  # body of the function
\end{minted}

Of course short version would be preferrable for unit tests.
\begin{minted}[]{yaml}
[fun, [double, x], [add, x, x]]
\end{minted}

After defining \textbf{double} function, it is really tempting to introduce \textbf{quad} function

\begin{minted}[]{yaml}
[fun, [quad, x], [double, [double, x]]]
\end{minted}
functions should be able to call one another, otherwise what is the point in defining them?


Functions without parameters should also be possible.

\begin{minted}[]{yaml}
[fun, [const42], 42]
\end{minted}

We will work with functions having single argument for now, and will deal with multiple arguments representation little bit later.

\subsection{Dealing with function and argument names}
\label{sec:org6d4d7dd}
Now we have a good understanding how our function definitions would look like in yaml, let's think about how we gonna represent them in Kotlin.

Before we start implementing anyting, we need to decide, how we can represent function and variables names.

\begin{minted}[]{yaml}
[fun, [double, x], [add, x, x]]
\end{minted}

When looking into this expression from yaml perspective `x` and `double` will be represented as strings.
But semantically they should be different. They should represent some identifier, or a symbol if you wish.

Therefore we need to expand our parser to support symbols.

\begin{minted}[]{kotlin}
data class ESymbol(val value:String):Expression{
    override fun eval(): Expression {
        return this
    }

    override fun unparse(): String {
        return value
    }
}

\end{minted}

Here how our representation would look like
\begin{minted}[]{kotlin}
data class EFunDef(val name:ESymbol, val argument:ESymbol, val body:Expression):Expression{
    override fun eval(): Expression {
        return this
    }

    override fun unparse(): String {
        return "[fun, [${name.unparse()}, ${argument.unparse()}], ${body.unparse()}]"
    }
}

\end{minted}

Function definition is evaluated to itself. It is just a delcaration of the function, it doesn't do anything at all.

To make a function call, we need to have different structure. In some places it is called \textbf{function application}, i would use \textbf{function call}, since it is less academic and more commonly used
\begin{minted}[]{kotlin}
data class EFunCall(val name:ESymbol, val argument:Expression):Expression{
    override fun eval(): Expression {
        TODO("Not yet implemented")
    }

    override fun unparse(): String {
        return "[${name.unparse()}, ${argument.unparse()}]"
    }

}
\end{minted}

We dont' know exactly how evaluation will work, but we can alreade expand our parser to support both function definitions and function calls.
\subsection{Expanding parser for function definitions and calls}
\label{sec:org8d2ad9a}
When we are starting new implementation, and not totally sure what expected result is, we write tests.
Parsing function definition looks like a good point.


\section{Pros and cons of sugaring}
\label{sec:org61c1dd2}
\subsection{performance hit}
\label{sec:org57d9643}
\subsection{simplified runtime}
\label{sec:orgfc00f36}
\subsection{Haskell core language}
\label{sec:org9da2da1}
\subsection{targeting degugaring}
\label{sec:orgd118191}
\subsection{WebAssembly desugar}
\label{sec:orga868b36}
\subsection{python desugar}
\label{sec:org427551c}

\section{Errors and strange things}
\label{sec:org8448893}
\subsection{adding division}
\label{sec:org4590eba}
\subsection{what should happen if we divide by zero?}
\label{sec:org14af7ae}
\subsection{It's all about environment}
\label{sec:orgd461d19}
