plan.org
* Defining variables for fun and profit
While working with the expressions, it might be useful to have some variables.
for example, ability to compute something like this:
#+begin_src yaml
[mul, x, 3]
#+end_src
To make it happen, we need to do some preparations.
First of all, we need to understand what `x` means during parsing.
Secondly, we should take the value attached to `x` from somewhere.

If we try to use default yaml parser, it will say that `x` is represented as a string.
And while we are not working with strings in our language at the moment, we definitely will be in the future.
So during parsing we shall convert this string to some new type of the data.
Something that can be treated as identifier or variable name. Let's call it a symbol

#+begin_src kotlin
data class ESymbol(val value:String):Expression{
    override fun eval(): Expression {
        return this
    }

    override fun unparse(): String {
        return value
    }
}

data class SugarSymbol(val name:String):SugarExpression{
    override fun desugar(): Expression {
       return ESymbol(name)
    }

}
#+end_src
Here's an example how it should work
#+begin_src kotlin
    @Test
    fun testOperationWithSymbol(){
        assertEquals(SugarAdd(SugarSymbol("x"), SugarInt(5)),
                     parse("[add, x, 5]"))

        assertEquals(SugarAdd(SugarSymbol("x"), SugarSymbol("y")),
                     parse("[add, x, y]"))

        assertEquals(SugarAdd(
                         SugarAdd(SugarSymbol("x"), SugarSymbol("y")),
                        SugarSymbol("z")),
            parse("[add, [add, x, y], z]"))

    }
#+end_src
Now we have a way to introduce variables to the expressions, but how are we planning to evaluate them?
Which brings us to the next question
** Where do our variables live?
Variables should be defined somewhere. There should be a binding between symbol, and the value that symbol represents.

The easiest way to make this mapping would be a dictionary. Or a hashmap if you like.

#+begin_src kotlin
data class Environment(val bindings:HashMap<ESymbol, Expression>){
    fun addBinding( name:ESymbol,  value:Expression){
        bindings[name] = value
    }
    fun isDefined(name:ESymbol): Boolean{
        return bindings.containsKey(name)
    }
    fun get(name:ESymbol):Expression{
        return bindings[name]!!
    }
}
#+end_src
As you can see we are assuming that we use core language as part of bindings.
Since our evaluation process works on the core language, not the sugared one, this is very logical thing to do.

Test cases are following:

#+begin_src kotlin

    @Test
    fun isDefined() {
        val env = Environment(hashMapOf())
        assertFalse(env.isDefined(ESymbol("x")))
        val env2 = Environment(hashMapOf( Pair(ESymbol("x"), EInt(5))))
        assertTrue(env2.isDefined(ESymbol("x")))
    }
    @Test
    fun addBinding() {
        val env = Environment(hashMapOf())
        env.addBinding(ESymbol("x"), EInt(5))
        assertTrue(env.isDefined(ESymbol("x")))
        assertEquals(EInt(5), env.bindings[ESymbol("x")])
        assertEquals(EInt(5), env.get(ESymbol("x")))

    }
#+end_src

What would happen if you try to get the variable that is not defined in the environment?
You will get a runtime error of course. Error handling will be taken care of later. I promise :)
Let us focus on well-behaving programs, where nothing strange happens.

** Using environment in the evaluation
We know how to define variable, and bind values to them.
But it wont' be useful until we can attach this environment to our evaluation.
#+begin_src yaml
## somewhere out here we should have an environmet with defined 'x'
[add, x, 5]
#+end_src

The only place where we can plug it in is our *eval* function.
Time for the improvement

Remeber our *Expression* interface from very long time ago?
#+begin_src kotlin
interface Expression{
    fun eval():Expression
    fun unparse():String
}
#+end_src

We will tweak it a little bit

#+begin_src kotlin
interface Expression{
    fun eval(env:Environment):Expression
    fun unparse():String
}
#+end_src

We're claiming here that evaluation cannot happen in vacuum. We need to take into account an environment we're in.
Sometimes it might be an empty environment, somethimes it might be full of variable definitions.

This is a small step for our interface, but a huge impact for our interpreter.
It breaks all our evaluation implementations.
It breaks all our evaluation tests.
Good news is that we have tests, so we know what is broken.
What else can be done rather than fixing it?

