plan.tex

\subsection{Fixing evaluation with environment}
\label{sec:org26b85e2}
Our first case is really simple one.
\begin{minted}[]{kotlin}
data class EInt(val value:Int):Expression {
    override fun eval(): Expression {
        return this
    }
   ...
}
\end{minted}

How shall we interpret integer values if they live in some environment?
Easy. Integers are always integers, so we can simply ignore the environment.

\begin{minted}[]{kotlin}
data class EInt(val value:Int):Expression {
    override fun eval(env:Environment): Expression {
        return this
    }

    override fun unparse(): String {
        return value.toString()
    }
}
\end{minted}

Done.

With addition and multiplication it would be not as straighforward.

Let's stop and think for a moment.
What we would like to happen when we have an expression defined within environment?
\begin{minted}[]{yaml}
## env: {x = 5}
[add, x, 10]
\end{minted}

I would say it should be converted to
\begin{minted}[]{yaml}
[add, 5, 10]
\end{minted}
We don't care about the variable name. We care only about value attached to it. Its binding.

Having variable name, variable definition and expression where this variable exists, we want to substitute variable with its value.

\begin{minted}[]{kotlin}
fun substitute(variableName:ESymbol), env:Environment, expession:Expression): Expression
\end{minted}

If you're thinking this function should be part of the \textbf{Expression} interface, in tend to agree with you.

Our poor \textbf{Expression} is getting bigger and bigger, but it is a good things.

\begin{minted}[]{kotlin}
interface Expression{
    fun eval(env:Environment):Expression
    fun substitute(symbol:ESymbol, env:Environment):Environment
    fun unparse():String
}
\end{minted}

Now it breaks even more things in our code. But this is the price we need to pay.

\begin{minted}[]{kotlin}
data class EInt(val value:Int):Expression {
    override fun eval(env:Environment): Expression {
        return this
    }

    override fun substitute(symbol: ESymbol, env: Environment): Expression {
        return this
    }

    override fun unparse(): String {
        return value.toString()
    }
}
\end{minted}

for integers substituion is as easy as it gets.
We are just ignoring all the symbols and environment.

Let's see what we can do with \textbf{ESymbol}.
\begin{minted}[]{kotlin}
data class ESymbol(val name:String):Expression{
    ...
    override fun substitute(symbol: ESymbol, env: Environment): Expression {
        if(symbol.name == name){
            return env.get(symbol)
        }
        return this
    }
   ...
}
\end{minted}

if we are trying to substitue symbol, and it is definted in the environment, we will return record from the variable.

It might sound little bit confusing so here are few examples.

\begin{minted}[]{yaml}
# env: {x = 5}
x
\end{minted}

should be transformed to

\begin{minted}[]{yaml}
5
\end{minted}

And if variable is not bound in the environment
\begin{minted}[]{yaml}
# env: {x = 5}
y
\end{minted}

should remain untouched
\begin{minted}[]{yaml}
y
\end{minted}


Now that we've done with substitution for the symbols, addition and multiplication should be simple enough.

\begin{minted}[]{kotlin}
data class EAdd(val a:Expression, val b:Expression): Expression {
   ...
    override fun substitute(symbol: ESymbol, env: Environment): Expression {
        return EAdd(a.substitute(symbol, env), b.substitute(symbol,env))
    }
   ...
}

data class EMul(val a:Expression, val b:Expression): Expression {
    ...
    override fun substitute(symbol: ESymbol, env: Environment): Expression {
        return EMul(a.substitute(symbol, env), b.substitute(symbol, env))
    }
   ...
}

\end{minted}

As usual, our tests would show us an example what we expect to happen, and how the variable substitution should look like.

\begin{minted}[]{kotlin}
 @Test
    fun testSubstitution(){
        val env1 = Environment(hashMapOf(Pair(ESymbol("x"), EInt(5))))
        assertEquals(EInt(5), ESymbol("x").substitute(ESymbol("x"), env1))
        assertEquals(ESymbol("y"), ESymbol("y").substitute(ESymbol("x"), env1))

        assertEquals("[add, 5, 5]",
            parse("[add, x, x]").desugar()
                .substitute(ESymbol("x"), env1).unparse())

        assertEquals("[mul, 5, 5]",
            parse("[mul, x, x]").desugar()
                .substitute(ESymbol("x"), env1).unparse())

        assertEquals("[add, [mul, 5, 5], 5]",
            parse("[add, [mul, x, x], x]").desugar()
                .substitute(ESymbol("x"), env1).unparse())


        val env2 = Environment(hashMapOf(Pair(ESymbol("x"), EInt(5)),
            Pair(ESymbol("y"), EInt(7))))
            parse("[add, [mul, x, y], x]").desugar()
                .substitute(ESymbol("x"), env2).unparse())


        assertEquals("[add, [mul, 5, 7], 5]",
            parse("[add, [mul, x, y], x]").desugar()
                .substitute(ESymbol("x"), env2)
                .substitute(ESymbol("y"), env2)
                .unparse())

        val complexEnv = Environment(hashMapOf(Pair(ESymbol("x"),
            parse("[mul, 11, [add, [add, 3, 4], 11]]").desugar())))

        assertEquals("[add, [mul, 11, [add, [add, 3, 4], 11]], [mul, 11, [add, [add, 3, 4], 11]]]",
            parse("[add, x, x]").desugar()
                .substitute(ESymbol("x"), complexEnv)
                .unparse()
            )
    }
\end{minted}
As you can see, substitutions can be as complex as we want them to be.
Now it is good time to do something about evaluation.
\subsection{improving taking into account the variables.}
\label{sec:org3b58605}
At this point we know how to substitute variables, and we also know how to evaluate expressions.
So mixing these two together we will get the evaluation process.
\begin{minted}[]{kotlin}
        assertEquals("10",
            parse("[add, x, x]").desugar()
                .substitute(ESymbol("x"), env1)
                .eval(env1).unparse())

        assertEquals("25",
            parse("[mul, x, x]").desugar()
                .substitute(ESymbol("x"), env1)
                .eval(env1)
                .unparse())

        assertEquals("30",
            parse("[add, [mul, x, x], x]").desugar()
                .substitute(ESymbol("x"), env1)
                .eval(env1)
                .unparse())

\end{minted}
these examples would work, evaluation is simple and straghtforward

\begin{minted}[]{kotlin}
        assertEquals("[add, [mul, 5, y], 5]",
            parse("[add, [mul, x, y], x]").desugar()
                .substitute(ESymbol("x"), env2)
                .eval(env1)
                .unparse())

\end{minted}
and this will error out.
Because we cannot evaluate the symbol ' y'

As you can see for the evaluation it is really important to substitute all the variables before we do the evaluation. Otherwise we would get as what is know as 'variable not found' exception.

this is easily fixable. We just need to substitute 'y' as well
\begin{minted}[]{kotlin}
        assertEquals("[add, [mul, 5, y], 5]",
            parse("[add, [mul, x, y], x]").desugar()
                .substitute(ESymbol("x"), env2)
                .substitute(ESymbol("y"), env2)
                .eval(env1)
                .unparse())
\end{minted}

Now it is green.

In you looked carefully, you might see that substitution uses env2 for both variables, while evaluation uses 'env1'. This shows us flexibility the interpreter shows. But at the same time it reminds us how careful we should be about passing the correct environment.

Some might ask - why do we need to pass environment during the substitugion phase?
Can't it be taken from the environment during the evaluation phase?
Very good question. It could  be done that way, but you well need to do foreach replacement for every variable in the environment. While the expression itself might use only oe or two of them. Or manybe none at all.
