plan.tex
\subsection{Mutalbe vs immutable variables}
\label{sec:org0b292a4}
\section{Adding variables to the mix}
\label{sec:orge396963}
\subsection{should variables have a type?}
\label{sec:orgd333fbf}
\subsection{adding environment to our expressions}
\label{sec:orgc46eef3}
\subsection{if you change the environment, expression changes as well.}
\label{sec:org464f2b7}
\subsection{adding string support to the language}
\label{sec:org7d572cc}

\subsection{powers, exponents, mods and so on}
\label{sec:org109b740}
\section{Evaluating parameters of the funciton. Order matters}
\label{sec:orgb4cb22f}
\subsection{lazy vs eager evaluation. Pros, cons, implementation}
\label{sec:org5641765}
\section{Adding functions to the language.}
\label{sec:org394aa11}
\subsection{function definition syntax}
\label{sec:org464fbfe}
\subsection{function calls syntax}
\label{sec:org8cf8175}
\subsection{What should happen if you define function within the function?}
\label{sec:org94e6e38}
\subsection{What should happen if you call function within the function?}
\label{sec:orgde9c989}
\subsection{Few words on recursive calls}
\label{sec:org8a18ad5}
\section{Adding conditional expressions}
\label{sec:org3f2d5b8}
\subsection{adding boolean expression to the language}
\label{sec:orgcaee647}
\subsection{adding IFs to the mix}
\label{sec:orgf388edd}
\subsection{control flow is not as straighforward as you might think of it}
\label{sec:org71d95ed}
\section{Adding lists to the language}
\label{sec:org9f23cfc}
\subsection{how generic is your generic?}
\label{sec:org7335e3b}
\subsection{how generic is your function?}
\label{sec:org60a2d9f}
\subsection{adding foreach}
\label{sec:orgcee5b47}
\subsection{adding list comprehension}
\label{sec:org0c3bda0}
\section{Typing and optimisation. part 2}
\label{sec:orgffd028d}
\section{Something about evaluation speed}
\label{sec:org136025c}

\subsection{environments again}
\label{sec:org1bf95c1}
\subsection{tail call optimisation}
\label{sec:org4259604}
\subsection{JZ, JNZ, JMP, Lisp \& WebAssembly}
\label{sec:orgec1139a}
\section{Adding types to the language}
\label{sec:org2169e3e}
\subsection{number vs float vs int32 vs int64}
\label{sec:org1590b72}
\subsection{function should know about types as well}
\label{sec:orgeb694f2}
\section{Minimal required type theory}
\label{sec:org0d0012b}
\subsection{Why golang avoided generics for so long}
\label{sec:org4835ac1}
\subsection{How to read typing expressions}
\label{sec:org9047e3a}
\section{type inferencing  the language. Simple version}
\label{sec:org6368c1d}
\section{Generating WebAssembly for fun and profit}
\label{sec:orgcee79c4}
\section{Generating JVM based things for fun and profit}
\label{sec:orga848367}
\section{type inferencing on steroids}
\label{sec:org78bbfaa}
\subsection{How haskell, scala and friends work under the hood}
\label{sec:org85df50d}
\end{document}
